{
"articles": [
  {
    "title": "Image Blending",
    "subtitle": "Computational Photography Assignment 6",
    "featureImg": "pic01.jpg",
    "abstract": "Using convolution and Gaussian distribution, you can create a custom image-blending application.",
    "link": "image-blending",
    "views": 0
  }, {
    "title": "Room Obscura",
    "subtitle": "Computational Photography Assignment 5",
    "featureImg": "pic01.jpg",
    "abstract": "I had always been well aware of the pinhole camera, a science project that's about as old as the Roman empire, but I had never tried it myself before. This project took this classic experiment and scaled it to turn a whole room, not a shoebox, into a primitive camera.",
    "link": "room-obscura",
    "views": 0
  }, {
    "title": "Grade Calculator",
    "subtitle": "Course Grade Calculator",
    "featureImg": "pic01.jpg",
    "abstract": "If you're in school and, like me, enjoy playing the \"what-if\" game with your grades, you might find this fun and/or helpful",
    "link": "grade-calculator",
    "contentUrl": "omscs-gradecalculator",
    "views": 0
  }, {
    "title": "API Hacking",
    "subtitle": "Blog/tutorial on how APIs work",
    "featureImg": "pic01.jpg",
    "abstract": "Application program interfaces (APIs) are protocols and specifications for how a particular software service works. When you search for your local weather forecast, for example, whatever site you use will send weather data for your location using the same query parameters, response format, and subroutines as it would for any other valid location. This blog explains how you can look at just this data to figure out how to integrate these data into other sites, apps, or feeds.",
    "link": "api-hacking",
    "views": 0
  }, {
    "title": "Automated Speedtest",
    "subtitle": "Personal project forked from Matt Martz's <a href=\"https://github.com/sivel/speedtest-cli\">speedtest-cli</a>",
    "featureImg": "pic01.jpg",
    "abstract": "Crontab + Python = <i class=\"icon fa-heart\"></i>. Learned a lot from this project, specifically Linux, SSH, and VCS/CI. If you've got some old hardware lying around, set up your own server to automatically test your internet connection speed even when you're not home.",
    "link": "automated-speedtest",
    "views": 0
  }
]
}